# CLIツール
brew "git"
brew "gh"           # GitHub CLI
brew "mise"         # ランタイムバージョン管理 (node, go, rust, etc.)
brew "fzf"          # ファジーファインダー
brew "bat"          # シンタックスハイライト付きcat
brew "eza"          # モダンなls
brew "ripgrep"      # 高速grep (rg)
brew "fd"           # 高速find
brew "lazygit"      # Git TUI
brew "zoxide"       # スマートなcd
brew "tmux"         # ターミナルマルチプレクサ
brew "neovim"       # エディタ (mise ではなく brew で管理)

# macOS GUIアプリ
cask "affinity"
cask "clipy"
cask "discord"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"
cask "wezterm"
cask "wireshark-app"
